In [1]:
import pandas as pd
import numpy as np

# series object

In [2]:

data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data[1]

0.5

In [5]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [6]:
#series with index
data=pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [7]:
data['a']

0.25

In [8]:
#non contiguous or nonsequential indices
data=pd.Series([0.25,0.5,0.75,1.0],index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [9]:
#Series as dictionary
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [10]:
population_dict['California']

38332521

In [11]:
#array style slicing
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

# Dataframe object

In [46]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [45]:
pd.DataFrame(area_dict,index=['a','b','c','d','e'])

   California   Texas  New York  Florida  Illinois
a      423967  695662    141297   170312    149995
b      423967  695662    141297   170312    149995
c      423967  695662    141297   170312    149995
d      423967  695662    141297   170312    149995
e      423967  695662    141297   170312    149995

In [ ]:
# dataframe from dictionary of series object#unique

In [14]:
states=pd.DataFrame({'population':population,'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [15]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [16]:
states.columns

Index(['population', 'area'], dtype='object')

In [17]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [47]:
states['population']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: population, dtype: int64

In [53]:
#dataframe from dictionary
dict = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597, 1.221],
"population":[200.4, 143.5, 1252, 1357, 52.98] }
pd.DataFrame(dict)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [30]:
#importing data
df=pd.read_csv('pandas_data.csv')
#write data in a file
df.to_csv("b.csv")
df.to_excel("c.xlsx")
df

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jack    3.80

In [32]:
# co variance
df.cov()

             Age    Rating
Age     7.476190  0.494762
Rating  0.494762  0.488081

In [33]:
#details of a dataframe columns 
df.describe()

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [35]:
#upper part of a dataframe
df.head(n=3)

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98

In [36]:
#lowe part of a dataframe
df.tail(3)

   Age   Name  Rating
4   30  Steve     3.2
5   29  Smith     4.6
6   23   Jack     3.8

In [37]:
#transpose 
df.T

           0      1      2     3      4      5     6
Age       25     26     25    23     30     29    23
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [55]:
#unique item of a column
df['Age'].unique()

array([25, 26, 23, 30, 29], dtype=int64)

In [56]:
#conditional value 
df[df['Age']>20]

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jack    3.80

In [57]:
#duplicate boolean value
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [63]:
#drop duplicates
df.drop_duplicates()

   Age   Name  Rating
0   25    Tom    4.23
1   26  James    3.24
2   25  Ricky    3.98
3   23    Vin    2.56
4   30  Steve    3.20
5   29  Smith    4.60
6   23   Jack    3.80

In [68]:
#Add a new column using old column
df['age_plus_five']=df['Age']+5
df['age_plus_five']
df

   Age   Name  Rating  age_plus_five
0   25    Tom    4.23             30
1   26  James    3.24             31
2   25  Ricky    3.98             30
3   23    Vin    2.56             28
4   30  Steve    3.20             35
5   29  Smith    4.60             34
6   23   Jack    3.80             28

In [73]:
#drop not assinged(Na) values
df.dropna()
#fill na values
df.fillna(value=0)

   Age   Name  Rating  age_plus_five
0   25    Tom    4.23             30
1   26  James    3.24             31
2   25  Ricky    3.98             30
3   23    Vin    2.56             28
4   30  Steve    3.20             35
5   29  Smith    4.60             34
6   23   Jack    3.80             28

In [78]:
#mathmetical operation in dataframe column
print(df['Age'].mean())
print(df['Age'].min())
print(df['Age'].max())
print(df['Age'].count())
print(df.cumsum())

25.857142857142858
23
30
7
   Age                            Name Rating age_plus_five
0   25                             Tom   4.23            30
1   51                        TomJames   7.47            61
2   76                   TomJamesRicky  11.45            91
3   99                TomJamesRickyVin  14.01           119
4  129           TomJamesRickyVinSteve  17.21           154
5  158      TomJamesRickyVinSteveSmith  21.81           188
6  181  TomJamesRickyVinSteveSmithJack  25.61           216

In [79]:
#use numpy to get df.apply(np.cumsum)

   Age                            Name  Rating  age_plus_five
0   25                             Tom    4.23             30
1   51                        TomJames    7.47             61
2   76                   TomJamesRicky   11.45             91
3   99                TomJamesRickyVin   14.01            119
4  129           TomJamesRickyVinSteve   17.21            154
5  158      TomJamesRickyVinSteveSmith   21.81            188
6  181  TomJamesRickyVinSteveSmithJack   25.61            216